{
  "report": {
    "matchId": "BR1_3129688377",
    "matchResume": "Você enfrentou um Renekton no topo e saiu atrás já nos primeiros minutos. Terminou 2/9/3, sem levar torre e com ~4,9 CS por minuto. O Renekton abriu mais de 4 mil de ouro, empurrou barricadas e virou o lado do mapa, enquanto você ficou como principal fonte de ouro para o time inimigo. Ainda assim, colocou 5 sentinelas de controle e ficou vivo o suficiente para aplicar alguns controles de grupo importantes em lutas.",
    "pros": [
      "Boa colocação de visão: 14 sentinelas totais e 5 de controle, mantendo o rio coberto.",
      "Teve um solo kill cedo, mostrando que entende o potencial do Q+E em range corpo-a-corpo.",
      "Conseguiu engajar e imobilizar o Renekton 4 vezes para o seu caçador, mesmo atrás.",
      "Sobreviveu a alguns mergulhos com 1 dígito de vida, indicando uso correto da passiva para sustento."
    ],
    "cons": [
      "CS baixo (148 em 29 min). Isso atrasou níveis e ouro, dificultando brigar de igual para igual.",
      "9 mortes, muitas antes dos 14 min, entregando ouro e controle de rota ao Renekton.",
      "Pouca pressão de torre (3 k de dano na estrutura) — a rota ficou sempre empurrada contra você.",
      "Uso tímido do Teleporte: só 3 utilizações e nenhuma para criar vantagem numérica em dragão ou arauto.",
      "W pouco valor: foram apenas 4,7 k de dano verdadeiro no jogo todo; sinal de que está usando fora do pico de dano ou virado para o lado errado.",
      "Só 1 sentinela inimiga abatida; visão foi colocada, mas não negada."
    ],
    "generalWarnings": "Renekton é mais forte nos níveis 1-3 e explora trocas curtas. Se tomar dois ciclos de dash + stun com a barra de fúria cheia, dificilmente você ganha a troca. Evite lutar quando a fúria dele estiver acima de 50 e mantenha a onda congelada perto da sua torre nos primeiros 6 min. Caso fique atrás, jogue recuado e peça ajuda do jungler — estender troca sozinho só aumenta a vantagem dele.",
    "conclusion": "Foque em três pontos: (1) gerenciamento de ondas — congele a wave cedo, force o Renekton a avançar e abra janela para gank; (2) padrão de troca — guarde seu E para interromper o segundo dash dele e use o W apenas depois de receber o dano pesado, virado para o alvo; (3) macro & Teleporte — plante visão profunda no tri-arbusto ou pixel, limpe wards com varredor e use TP pro drag ou pra cobrir dive no bot. Executando isso, você neutraliza o early game do Renekton e transforma o Sett em frontliner sólido para as lutas de meio de jogo."
  }
}
